Andydingbing/SPC5/rd/chip/reg_def_ad908x.h
#ifndef INCLUDE_REG_DEF_AD908X_H
#define INCLUDE_REG_DEF_AD908X_H

#include "reg_def.h"

#define AD908X_REG_DECL(addr,init) REG_DECL_INIT(ns_reg_ad908x,addr,init)
#define AD908X_REG_DATA(addr) REG_DATA(ns_reg_ad908x,addr)
#define AD908X_REG(addr) REG(ns_reg_ad908x,addr)
#define AD908X_REG_W(addr) INT_CHECK(set_reg(addr,AD908X_REG_DATA(addr)))

namespace ns_reg_ad908x {

/*
 * cddc : coarse digital down conversion
 * pfilt : programmable FIR filter
 * piw : phase_inc_word
 *
 */

REG_DEF_CPT_PREFIX_8(0x0000)
    unsigned soft_reset : 1;
    unsigned lsb_first : 1;
    unsigned addr_inc : 1;
    unsigned sdo_active : 1;
    unsigned sdo_active_m : 1;
    unsigned addr_inc_m : 1;
    unsigned lsb_first_m : 1;
    unsigned soft_reset_m : 1;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0001)
    unsigned rsv0 : 7;
    unsigned single_ins : 1;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0002)
    unsigned rsv0 : 2;
    unsigned cust_op_mode : 2;
    unsigned rsv1 : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0003)
    unsigned chip_type : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0006)
    unsigned chip_grade : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x000b)
    unsigned spi_revision : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x000c)
    unsigned vendor_id_lsb : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x000d)
    unsigned vendor_id_msb : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0010)
    unsigned chip_id_l : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0011)
    unsigned chip_id_m1 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0012)
    unsigned chip_id_m2 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0013)
    unsigned chip_id_h : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0018)
    unsigned adc_page : 4;
    unsigned cddc_page : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0019)
    unsigned fine_ddc0_page : 1;
    unsigned fine_ddc1_page : 1;
    unsigned fine_ddc2_page : 1;
    unsigned fine_ddc3_page : 1;
    unsigned fine_ddc4_page : 1;
    unsigned fine_ddc5_page : 1;
    unsigned fine_ddc6_page : 1;
    unsigned fine_ddc7_page : 1;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x001a)
    unsigned jtx_link0_page : 1;
    unsigned jtx_link1_page : 1;
    unsigned rsv0 : 6;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x001b)
    unsigned dac_page_msk : 4;
    unsigned rsv0 : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x001c)
    unsigned dac_chan_msk : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x001d)
    unsigned jesd204c_rcv_link_msk : 2;
    unsigned mods_msk : 2;
    unsigned rsv0 : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x001e)
    unsigned pfilt_adc_pair0_page : 1;
    unsigned pfilt_adc_pair1_page : 1;
    unsigned rsv0 : 6;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x001f)
    unsigned pfilt_coef_page0 : 1;
    unsigned pfilt_coef_page1 : 1;
    unsigned pfilt_coef_page2 : 1;
    unsigned pfilt_coef_page3 : 1;
    unsigned rsv0 : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0020)
    unsigned rsv0 : 2;
    unsigned en_sysref_irq : 1;
    unsigned rsv1 : 3;
    unsigned en_data_ready : 1;
    unsigned rsv2 : 1;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0023)
    unsigned en_pll_lock_fast_irq : 1;
    unsigned en_pll_lock_slow_irq : 1;
    unsigned en_pll_lost_fast_irq : 1;
    unsigned en_pll_lost_slow_irq : 1;
    unsigned en_dll_lock01 : 1;
    unsigned en_dll_lost01 : 1;
    unsigned en_dll_lock23 : 1;
    unsigned en_dll_lost23 : 1;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0026)
    unsigned rsv0 : 2;
    unsigned irq_sysref_jitter : 1;
    unsigned rsv1 : 3;
    unsigned irq_data_ready : 1;
    unsigned rsv2 : 1;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0027)
    unsigned rsv0 : 3;
    unsigned irq_pa_err0 : 1;
    unsigned rsv1 : 3;
    unsigned irq_pa_err1 : 1;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0028)
    unsigned rsv0 : 3;
    unsigned irq_pa_err2 : 1;
    unsigned rsv1 : 3;
    unsigned irq_pa_err3 : 1;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0029)
    unsigned irq_pll_lock_fast : 1;
    unsigned irq_pll_lock_slow : 1;
    unsigned rsv0 : 6;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x002c)
    unsigned rsv0 : 2;
    unsigned mux_sysref_jitter : 1;
    unsigned rsv1 : 2;
    unsigned mux_lane_fifo : 1;
    unsigned mux_data_ready : 1;
    unsigned mux_jesd_irq : 1;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x002d)
    unsigned rsv0 : 3;
    unsigned mux_pa_err0 : 1;
    unsigned rsv1 : 3;
    unsigned mux_pa_err1 : 1;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x002e)
    unsigned rsv0 : 3;
    unsigned mux_pa_err2 : 1;
    unsigned rsv1 : 3;
    unsigned mux_pa_err3 : 1;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x002f)
    unsigned mux_pll_lock_fast : 1;
    unsigned mux_pll_lock_slow : 1;
    unsigned rsv0 : 6;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0032)
    unsigned irq_status_all : 1;
    unsigned rsv0 : 7;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0038)
    unsigned sync1_outbp_cfg : 4;
    unsigned sync1_outbn_cfg : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0061)
    unsigned en_dll : 1;
    unsigned rsv1 : 7;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0063)
    unsigned dll_locked : 1;
    unsigned dll_lost : 1;
    unsigned rsv0 : 6;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0090)
    unsigned dac_pd0 : 1;
    unsigned dac_pd1 : 1;
    unsigned dac_pd2 : 1;
    unsigned dac_pd3 : 1;
    unsigned rsv0 : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0091)
    unsigned aclk_pd : 1;
    unsigned rsv0 : 7;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0093)
    unsigned pll_div : 2;
    unsigned rsv0 : 6;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0094)
    unsigned rsv0 : 7;
    unsigned bypass_pll : 1;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x00b4)
    unsigned sysref_cnt : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x00b5)
    unsigned sysref_phase : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x00b6)
    unsigned sysref_phase : 5;
    unsigned rsv0 : 3;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x00b8)
    unsigned sysref_mode_continuous : 1;
    unsigned sysref_mode_oneshot : 1;
    unsigned rsv0 : 2;
    unsigned oneshot_sync_done : 1;
    unsigned rsv1 : 3;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x00b9)
    unsigned rotation_mode : 2;
    unsigned rsv0 : 2;
    unsigned en_nco_rst_after_rot : 1;
    unsigned rsv1 : 3;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x00ba)
    unsigned sysref_average : 3;
    unsigned rsv0 : 5;
REG_DEF_CPT_SUFFIX_8

