Andydingbing/SPC5/rd/chip/reg_def_ad908x.h
REG_DEF_CPT_PREFIX_8(0x00bc)
    unsigned nco_sync_ms_trig : 1;
    unsigned rsv0 : 7;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x00bf)
    unsigned oneshot_sync_hw : 1;
    unsigned rsv0 : 7;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x00c0)
    unsigned rsv0 : 1;
    unsigned en_tx_clk : 1;
    unsigned rsv1 : 2;
    unsigned direct_loopback_mode : 2;
    unsigned rsv2 : 2;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x00c2)
    unsigned loopback_cb_ctrl : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x00ca)
    unsigned sds_pll_refclk_div_spi : 6;
    unsigned rsv0 : 1;
    unsigned en_sds_pll_refclk_div_spi : 1;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x00cb)
    unsigned nco_sync_sysref_mode : 2;
    unsigned nco_sync_sysref_mode_rx : 2;
    unsigned rsv0 : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x00cc)
    unsigned nco_sync_ms_mode : 2;
    unsigned nco_sync_ms_trig_src : 2;
    unsigned rsv0 : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x00d0)
    unsigned en_spi_d2a0 : 1;
    unsigned en_spi_d2a1 : 1;
    unsigned en_spi_d2a_center : 1;
    unsigned en_spi_ana_center : 1;
    unsigned en_spi_dac_ana : 1;
    unsigned rsv0 : 3;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x00d1)
    unsigned en_spi_reg8_adc0 : 1;
    unsigned en_spi_reg8_adc1 : 1;
    unsigned rsv0 : 2;
    unsigned en_spi_reg32_adc0 : 1;
    unsigned en_spi_reg32_adc1 : 1;
    unsigned rsv1 : 2;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x00e2)
    unsigned d_cal_reset : 1;
    unsigned rsv0 : 7;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x00e3)
    unsigned d_refin_div : 2;
    unsigned rsv0 : 6;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x00e4)
    unsigned d_cp_current : 6;
    unsigned rsv0 : 2;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x00e9)
    unsigned d_div_ctrl : 6;
    unsigned rsv0 : 2;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x00ec)
    unsigned rsv0 : 1;
    unsigned d_pll_lock_ctrl : 2;
    unsigned rsv1 : 1;
    unsigned d_ctrl_hs_fb_div : 2;
    unsigned rsv2 : 2;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x00f7)
    unsigned d_cp_bleed : 6;
    unsigned rsv0 : 2;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0140)
    unsigned rsv0 : 4;
    unsigned msb_mode : 2;
    unsigned rsv1 : 2;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0143)
    unsigned rsv0 : 5;
    unsigned en_msb_rotation : 1;
    unsigned rsv1 : 2;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0180)
    unsigned adc_clk_div_spi : 2;
    unsigned rsv0 : 2;
    unsigned adc_clk_div_pd : 1;
    unsigned rsv1 : 3;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0196)
    unsigned adc_driver_data_ctrl : 5;
    unsigned rsv0 : 3;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0198)
    unsigned rsv0 : 1;
    unsigned sel_adc_clk_driver : 1;
    unsigned rsv1 : 6;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x019a)
    unsigned sysref_pd : 1;
    unsigned rsv0 : 6;
    unsigned sysref_bias_pd : 1;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01a0)
    unsigned en_test_tone : 1;
    unsigned ddsc_sel_sideband : 1;
    unsigned en_ddsc_modulus : 1;
    unsigned rsv0 : 3;
    unsigned en_ddsc_nco : 1;
    unsigned rsv1 : 1;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01a1)
    unsigned ddsc_ftw_load_req : 1;
    unsigned rsv0 : 1;
    unsigned ddsc_ftw_load_sysref : 1;
    unsigned rsv1 : 5;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01a2)
    unsigned ddsc_ftw : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01a3)
    unsigned ddsc_ftw : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01a4)
    unsigned ddsc_ftw : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01a5)
    unsigned ddsc_ftw : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01a6)
    unsigned ddsc_ftw : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01a7)
    unsigned ddsc_ftw : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01a8)
    unsigned ddsc_nco_phase_offset : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01a9)
    unsigned ddsc_nco_phase_offset : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01aa)
    unsigned ddsc_acc_modulus : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01ab)
    unsigned ddsc_acc_modulus : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01ac)
    unsigned ddsc_acc_modulus : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01ad)
    unsigned ddsc_acc_modulus : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01ae)
    unsigned ddsc_acc_modulus : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01af)
    unsigned ddsc_acc_modulus : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01b0)
    unsigned ddsc_acc_delta : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01b1)
    unsigned ddsc_acc_delta : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01b2)
    unsigned ddsc_acc_delta : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01b3)
    unsigned ddsc_acc_delta : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01b4)
    unsigned ddsc_acc_delta : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01b5)
    unsigned ddsc_acc_delta : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01b6)
    unsigned dc_offset : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01b7)
    unsigned dc_offset : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01b8)
    unsigned gain : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01b9)
    unsigned gain : 4;
    unsigned rsv0 : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01ba)
    unsigned en_ch : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01c6)
    unsigned skew_adj : 4;
    unsigned rsv0 : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01c7)
    unsigned nco_sync_ch : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01c8)
    unsigned en_main_dp_dac : 4;
    unsigned rsv0 : 3;
    unsigned en_main_dp_dac_spi : 1;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01c9)
    unsigned rsv0 : 1;
    unsigned ddsm_sel_sideband : 1;
    unsigned en_ddsm_modulus : 1;
    unsigned en_ddsm_nco : 1;
    unsigned ddsm_mode : 2;
    unsigned en_cmplx_mod : 1;
    unsigned rsv1 : 1;
REG_DEF_CPT_SUFFIX_8

