Andydingbing/SPC5/rd/chip/reg_def_ad908x.h
REG_DEF_CPT_PREFIX_8(0x01ca)
    unsigned ddsm_ftw_load_req : 1;
    unsigned rsv0 : 1;
    unsigned ddsm_ftw_load_sysref : 1;
    unsigned rsv1 : 5;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01cb)
    unsigned ddsm_ftw : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01cc)
    unsigned ddsm_ftw : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01cd)
    unsigned ddsm_ftw : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01ce)
    unsigned ddsm_ftw : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01cf)
    unsigned ddsm_ftw : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01d0)
    unsigned ddsm_ftw : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01d1)
    unsigned ddsm_nco_phase_offset : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01d2)
    unsigned ddsm_nco_phase_offset : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01d3)
    unsigned ddsm_acc_modulus : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01d4)
    unsigned ddsm_acc_modulus : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01d5)
    unsigned ddsm_acc_modulus : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01d6)
    unsigned ddsm_acc_modulus : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01d7)
    unsigned ddsm_acc_modulus : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01d8)
    unsigned ddsm_acc_modulus : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01d9)
    unsigned ddsm_acc_delta : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01da)
    unsigned ddsm_acc_delta : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01db)
    unsigned ddsm_acc_delta : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01dc)
    unsigned ddsm_acc_delta : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01dd)
    unsigned ddsm_acc_delta : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01de)
    unsigned ddsm_acc_delta : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01E5)
    unsigned ddsm_cal_ftw : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01e6)
    unsigned ddsm_cal_ftw : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01e7)
    unsigned ddsm_cal_ftw : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01e8)
    unsigned ddsm_cal_ftw : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01e9)
    unsigned en_ddsm_cal_freq_tune : 1;
    unsigned en_ddsm_cal_dc_input : 1;
    unsigned en_ddsm_cal_acc : 1;
    unsigned rsv0 : 5;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01ef)
    unsigned rsv0 : 4;
    unsigned en_nco_1x1x : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01f0)
    unsigned rsv0 : 4;
    unsigned en_dac_maindp : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01f1)
    unsigned txen_route_ctrl : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01f6)
    unsigned nco_sync_main_sel : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01fb)
    unsigned start_nco_sync : 1;
    unsigned rsv0 : 7;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01fe)
    unsigned rsv0 : 6;
    unsigned com_sync : 1;
    unsigned mode_not_in_table : 1;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x01ff)
    unsigned fine_interp_mode : 4;
    unsigned coarse_interp_mode : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0200)
    unsigned ch_interp_mode_dec : 3;
    unsigned dp_interp_mode_dec : 3;
    unsigned rsv0 : 2;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0203)
    unsigned en_spi_main_nco_rst : 4;
    unsigned rsv0 : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0204)
    unsigned en_spi_ch_nco_rst : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0280)
    unsigned adc_coarse_cb : 4;
    unsigned c_mxr_iq_sfl : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0281)
    unsigned coarse_fine_cb1 : 1;
    unsigned coarse_fine_cb2 : 1;
    unsigned coarse_fine_cb3 : 1;
    unsigned coarse_fine_cb4 : 1;
    unsigned coarse_fine_cb5 : 1;
    unsigned coarse_fine_cb6 : 1;
    unsigned coarse_fine_cb7 : 1;
    unsigned coarse_fine_cb8 : 1;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0282)
    unsigned coarse_dec_sel : 4;
    unsigned coarse_c2r_en : 1;
    unsigned coarse_gain : 1;
    unsigned coarse_mxr_if : 2;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0283)
    unsigned fine_dec_sel : 3;
    unsigned rsv0 : 1;
    unsigned fine_c2r_en : 1;
    unsigned fine_gain : 1;
    unsigned fine_mxr_if : 2;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0284)
    unsigned ddc_overall_dec : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0285)
    unsigned en_coarse_ddc : 4;
    unsigned rsv0 : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0286)
    unsigned en_fine_ddc1 : 1;
    unsigned en_fine_ddc2 : 1;
    unsigned en_fine_ddc3 : 1;
    unsigned en_fine_ddc4 : 1;
    unsigned en_fine_ddc5 : 1;
    unsigned en_fine_ddc6 : 1;
    unsigned en_fine_ddc7 : 1;
    unsigned en_fine_ddc8 : 1;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0287)
    unsigned bypass_fine1 : 1;
    unsigned bypass_fine2 : 1;
    unsigned bypass_fine3 : 1;
    unsigned bypass_fine4 : 1;
    unsigned bypass_fine5 : 1;
    unsigned bypass_fine6 : 1;
    unsigned bypass_fine7 : 1;
    unsigned bypass_fine8 : 1;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0289)
    unsigned chip_dec_ratio : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x028a)
    unsigned en_common_hop : 1;
    unsigned rsv0 : 7;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02a1)
    unsigned dformat_ctrl_bit0_sel : 4;
    unsigned dformat_ctrl_bit1_sel : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02a2)
    unsigned dformat_ctrl_bit2_sel : 4;
    unsigned rsv0 : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02a3)
    unsigned dformat_sel : 2;
    unsigned dformat_inv : 1;
    unsigned rsv0 : 5;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02a4)
    unsigned dformat_ovr_clr : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02a5)
    unsigned dformat_ovr_clr : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02a6)
    unsigned dformat_ovr_status : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02a7)
    unsigned dformat_ovr_status : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02a8)
    unsigned dformat_res : 4;
    unsigned en_dformat_fbw_dither : 1;
    unsigned en_dformat_ddc_dither : 1;
    unsigned rsv0 : 2;
REG_DEF_CPT_SUFFIX_8

