Andydingbing/SPC5/rd/chip/reg_def_ad908x.h
REG_DEF_CPT_PREFIX_8(0x02a9)
    unsigned dformat_fd_sel : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02aa)
    unsigned dformat_fd_sel : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02ab)
    unsigned dformat_fbw_sel : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02ac)
    unsigned dformat_fbw_sel : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02ad)
    unsigned dformat_tmode_sel : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02ae)
    unsigned dformat_tmode_sel : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02b0)
    unsigned tmode_i_pn_sel : 4;
    unsigned tmode_i_type_sel : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02b1)
    unsigned rsv0 : 6;
    unsigned tmode_i_pn_force_rst : 1;
    unsigned tmode_i_flush : 1;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02b2)
    unsigned tmode_i_usr_pat0 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02b3)
    unsigned tmode_i_usr_pat0 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02b4)
    unsigned tmode_i_usr_pat1 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02b5)
    unsigned tmode_i_usr_pat1 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02b6)
    unsigned tmode_i_usr_pat2 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02b7)
    unsigned tmode_i_usr_pat2 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02b8)
    unsigned tmode_i_usr_pat3 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02b9)
    unsigned tmode_i_usr_pat3 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02ba)
    unsigned rsv0 : 3;
    unsigned nco_rst_all_sysref : 1;
    unsigned allow_sysref_mask : 1;
    unsigned rsv1 : 3;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02bd)
    unsigned en_gpio_trig : 1;
    unsigned rsv0 : 1;
    unsigned loopback_master_trig : 1;
    unsigned rsv1 : 1;
    unsigned en_gpio_trig_sync : 1;
    unsigned gpio_trig_deglitch : 1;
    unsigned rsv2 : 2;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02c6)
    unsigned rxen0_fddc_sel : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02c7)
    unsigned rxen0_cddc_sel : 4;
    unsigned rxen0_jtxl_sel : 2;
    unsigned rxen0_adc_sel : 2;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02c8)
    unsigned rxen0_jtx_phy_sel : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02c9)
    unsigned rxen1_fddc_sel : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02ca)
    unsigned rxen1_cddc_sel : 4;
    unsigned rxen1_jtxl_sel : 2;
    unsigned rxen1_adc_sel : 2;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02cb)
    unsigned rxen1_jtx_phy_sel : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02cc)
    unsigned fine_ddc_i_status_sel : 2;
    unsigned fine_ddc_q_status_sel : 2;
    unsigned rsv0 : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02cd)
    unsigned fd_eq_i_status_sel : 2;
    unsigned fd_eq_q_status_sel : 2;
    unsigned rsv0 : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02ce)
    unsigned rxengp0_fddc_sel : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02cf)
    unsigned rxengp0_cddc_sel : 4;
    unsigned rxengp0_jtxl_sel : 2;
    unsigned rxengp0_adc_sel : 2;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02d0)
    unsigned rxengp0_jtx_phy_sel : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02d1)
    unsigned rxengp1_fddc_sel : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02d2)
    unsigned rxengp1_cddc_sel : 4;
    unsigned rxengp1_jtxl_sel : 2;
    unsigned rxengp1_adc_sel : 2;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02d3)
    unsigned rxengp1_jtx_phy_sel : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02d4)
    unsigned tmode_q_pn_sel : 4;
    unsigned tmode_q_type_sel : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02d5)
    unsigned rsv0 : 6;
    unsigned tmode_q_pn_force_rst : 1;
    unsigned tmode_q_flush : 1;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02d6)
    unsigned tmode_q_usr_pat0 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02d7)
    unsigned tmode_q_usr_pat0 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02d8)
    unsigned tmode_q_usr_pat1 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02d9)
    unsigned tmode_q_usr_pat1 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02da)
    unsigned tmode_q_usr_pat2 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02db)
    unsigned tmode_q_usr_pat2 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02dc)
    unsigned tmode_q_usr_pat3 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02dd)
    unsigned tmode_q_usr_pat3 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02e9)
    unsigned en_coarse_ddc1 : 1;
    unsigned en_coarse_ddc2 : 1;
    unsigned en_coarse_ddc3 : 1;
    unsigned en_coarse_ddc4 : 1;
    unsigned rsv0 : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02ea)
    unsigned tmode_i_usr_pat4 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02eb)
    unsigned tmode_i_usr_pat4 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02ec)
    unsigned tmode_i_usr_pat5 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02ed)
    unsigned tmode_i_usr_pat5 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02ee)
    unsigned tmode_i_usr_pat6 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02ef)
    unsigned tmode_i_usr_pat6 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02f0)
    unsigned tmode_i_usr_pat7 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02f1)
    unsigned tmode_i_usr_pat7 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02f2)
    unsigned tmode_q_usr_pat4 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02f3)
    unsigned tmode_q_usr_pat4 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02f4)
    unsigned tmode_q_usr_pat5 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02f5)
    unsigned tmode_q_usr_pat5 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02f6)
    unsigned tmode_q_usr_pat6 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02f7)
    unsigned tmode_q_usr_pat6 : 8;
REG_DEF_CPT_SUFFIX_8

