Andydingbing/SPC5/rd/chip/reg_def_ad908x.h
REG_DEF_CPT_PREFIX_8(0x02f8)
    unsigned tmode_q_usr_pat7 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02f9)
    unsigned tmode_q_usr_pat7 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02fa)
    unsigned rxen0_use_txen : 1;
    unsigned rxen1_use_txen : 1;
    unsigned rxen0_pol : 1;
    unsigned rxen1_pol : 1;
    unsigned rxengp0_pol : 1;
    unsigned rxengp1_pol : 1;
    unsigned rsv0 : 2;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02fb)
    unsigned en_rxen0_spi : 1;
    unsigned en_rxen1_spi : 1;
    unsigned en_rxengp0_spi : 1;
    unsigned en_rxengp1_spi : 1;
    unsigned rxen0_spi : 1;
    unsigned rxen1_spi : 1;
    unsigned rxengp0_spi : 1;
    unsigned rxengp1_spi : 1;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02fc)
    unsigned rxen0_0s_ctrl : 1;
    unsigned rxengp0_0s_ctrl : 1;
    unsigned rxen1_1s_ctrl : 1;
    unsigned rxengp1_1s_ctrl : 1;
    unsigned rxen0_0f_ctrl : 1;
    unsigned rxengp0_0f_ctrl : 1;
    unsigned rxen1_1f_ctrl : 1;
    unsigned rxengp1_1f_ctrl : 1;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x02fd)
    unsigned rxen0_2s_ctrl : 1;
    unsigned rxengp0_2s_ctrl : 1;
    unsigned rxen1_3s_ctrl : 1;
    unsigned rxengp1_3s_ctrl : 1;
    unsigned rxen0_2f_ctrl : 1;
    unsigned rxengp0_2f_ctrl : 1;
    unsigned rxen1_3f_ctrl : 1;
    unsigned rxengp1_3f_ctrl : 1;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0300)
    unsigned rsv0 : 7;
    unsigned en_soft_off_gain : 1;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0301)
    unsigned en_spi_soft_off : 1;
    unsigned en_tx_soft_off : 1;
    unsigned en_rotate_soft_off : 1;
    unsigned en_jesd_err_soft_off : 1;
    unsigned rsv0 : 2;
    unsigned en_long_pa_err_soft_off : 1;
    unsigned en_short_pa_err_soft_off : 1;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0302)
    unsigned en_dll_unlock_soft_off : 1;
    unsigned en_204c_crc_err_soft_off : 1;
    unsigned rsv0 : 2;
    unsigned en_slew_rate_err_soft_off : 1;
    unsigned rsv1 : 3;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0303)
    unsigned rsv0 : 6;
    unsigned en_long_level_soft_on : 1;
    unsigned en_spi_soft_on : 1;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0304)
    unsigned en_all_short_pa : 1;
    unsigned en_all_long_pa : 1;
    unsigned en_all_soft_off_gain : 1;
    unsigned rsv0 : 5;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0305)
    unsigned long_pa_threshold : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0306)
    unsigned long_pa_threshold : 5;
    unsigned rsv0 : 3;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0307)
    unsigned long_pa_avg_time : 4;
    unsigned rsv0 : 3;
    unsigned en_long_pa : 1;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0308)
    unsigned long_pa_pwr : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0309)
    unsigned long_pa_pwr : 5;
    unsigned rsv0 : 3;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x030a)
    unsigned short_pa_threshold : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x030b)
    unsigned short_pa_threshold : 5;
    unsigned rsv0 : 3;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x030c)
    unsigned short_pa_avg_time : 2;
    unsigned rsv0 : 5;
    unsigned en_short_pa : 1;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x030d)
    unsigned short_pa_pwr : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x030e)
    unsigned short_pa_pwr : 5;
    unsigned rsv0 : 3;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x030f)
    unsigned en_txen_sm : 1;
    unsigned rsv0 : 7;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x031f)
    unsigned spi_pa_ctrl : 1;
    unsigned en_pa_prot_pin_txen_sm : 1;
    unsigned en_pa_prot_pin_bl_sm : 1;
    unsigned en_pa_prot_pin_jesd_err : 1;
    unsigned en_pa_prot_pin_jesd204c_rcv_204c_crc_err : 1;
    unsigned en_long_pa_prot_pin_avg_pwr : 1;
    unsigned en_short_pa_prot_pin_avg_pwr : 1;
    unsigned rsv0 : 1;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0320)
    unsigned rsv0 : 2;
    unsigned en_pa_prot_pin_sr_err : 1;
    unsigned rsv1 : 5;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0321)
    unsigned rsv0 : 2;
    unsigned en_spi_txen : 1;
    unsigned spi_txen : 1;
    unsigned rsv1 : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0322)
    unsigned en_spi_flush : 1;
    unsigned rsv0 : 7;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0342)
    unsigned smon_status_fcnt : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0343)
    unsigned smon_period : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0344)
    unsigned smon_period : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0345)
    unsigned smon_period : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0346)
    unsigned smon_period : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0347)
    unsigned smon_status_update : 1;
    unsigned smon_status_rdsel : 3;
    unsigned rsv0 : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0348)
    unsigned en_smon_sframer : 1;
    unsigned smon_sframer_mode : 1;
    unsigned smon_sframer_insel : 6;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0349)
    unsigned en_smon_sync : 1;
    unsigned smon_sync_next : 1;
    unsigned rsv0 : 6;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x034a)
    unsigned smon_status : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x034b)
    unsigned smon_status : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x034c)
    unsigned smon_status : 4;
    unsigned rsv0 : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x034d)
    unsigned smon_threshold_low : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x034e)
    unsigned smon_threshold_low : 3;
    unsigned rsv0 : 5;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x034f)
    unsigned smon_threshold_high : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0350)
    unsigned smon_threshold_high : 3;
    unsigned rsv0 : 5;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0380)
    unsigned rx_dig_rst : 1;
    unsigned rsv0 : 3;
    unsigned lcpll_reg_rst : 1;
    unsigned rsv1 : 3;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0381)
    unsigned des_reg_rst : 1;
    unsigned rsv0 : 7;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0429)
    unsigned sel_synca_mode_rc : 1;
    unsigned rsv0 : 7;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x042a)
    unsigned sel_syncb_mode_rc : 1;
    unsigned rsv0 : 7;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x05bb)
    unsigned en_jesd204c_rcv_204c_crc_irq : 1;
    unsigned en_jesd204c_rcv_204c_mb_irq : 1;
    unsigned en_jesd204c_rcv_204c_sh_irq : 1;
    unsigned jesd204c_rcv_204c_crc_irq : 1;
    unsigned jesd204c_rcv_204c_mb_irq : 1;
    unsigned jesd204c_rcv_204c_sh_irq : 1;
    unsigned rsv0 : 2;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0721)
    unsigned pwr_up_lcpll : 1;
    unsigned rsv0 : 2;
    unsigned clr_lolb : 1;
    unsigned rsv1 : 1;
    unsigned bypass_pll_lock_input : 1;
    unsigned rsv2 : 2;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0743)
    unsigned rsv0 : 1;
    unsigned sel_synca_refclk : 1;
    unsigned rsv1 : 6;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0800)
    unsigned ddsm_hopf_sel : 5;
    unsigned rsv0 : 1;
    unsigned ddsm_hopf_mode : 2;
REG_DEF_CPT_SUFFIX_8

