Andydingbing/SPC5/rd/chip/reg_def_ad908x.h
REG_DEF_CPT_PREFIX_8(0x0806)
    unsigned ddsm_hopf_ftw : 8;
REG_DEF_CPT_SUFFIX_8

typedef reg0x0806
reg0x0807,reg0x0808,reg0x0809,reg0x080a,
reg0x080b,reg0x080c,reg0x080d,reg0x080e,
reg0x080f,reg0x0810,reg0x0811,reg0x0812,
reg0x0813,reg0x0814,reg0x0815,reg0x0816,
reg0x0817,reg0x0818,reg0x0819,reg0x081a,
reg0x081b,reg0x081c,reg0x081d,reg0x081e,
reg0x081f,reg0x0820,reg0x0821,reg0x0822,
reg0x0823,reg0x0824,reg0x0825,reg0x0826,
reg0x0827,reg0x0828,reg0x0829,reg0x082a,
reg0x082b,reg0x082c,reg0x082d,reg0x082e,
reg0x082f,reg0x0830,reg0x0831,reg0x0832,
reg0x0833,reg0x0834,reg0x0835,reg0x0836,
reg0x0837,reg0x0838,reg0x0839,reg0x083a,
reg0x083b,reg0x083c,reg0x083d,reg0x083e,
reg0x083f,reg0x0840,reg0x0841,reg0x0842,
reg0x0843,reg0x0844,reg0x0845,reg0x0846,
reg0x0847,reg0x0848,reg0x0849,reg0x084a,
reg0x084b,reg0x084c,reg0x084d,reg0x084e,
reg0x084f,reg0x0850,reg0x0851,reg0x0852,
reg0x0853,reg0x0854,reg0x0855,reg0x0856,
reg0x0857,reg0x0858,reg0x0859,reg0x085a,
reg0x085b,reg0x085c,reg0x085d,reg0x085e,
reg0x085f,reg0x0860,reg0x0861,reg0x0862,
reg0x0863,reg0x0864,reg0x0865,reg0x0866,
reg0x0867,reg0x0868,reg0x0869,reg0x086a,
reg0x086b,reg0x086c,reg0x086d,reg0x086e,
reg0x086f,reg0x0870,reg0x0871,reg0x0872,
reg0x0873,reg0x0874,reg0x0875,reg0x0876,
reg0x0877,reg0x0878,reg0x0879,reg0x087a,
reg0x087b,reg0x087c,reg0x087d,reg0x087e,
reg0x087f,reg0x0880,reg0x0881;

REG_DEF_CPT_PREFIX_8(0x0a00)
    unsigned en_ddc_sync : 1;
    unsigned ddc_sync_next : 1;
    unsigned rsv0 : 2;
    unsigned ddc_soft_rst : 1;
    unsigned rsv1 : 2;
    unsigned en_ddc_trig_nco_rst : 1;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a02)
    unsigned en_ddc_trig_hop : 1;
    unsigned rsv0 : 7;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a03)
    unsigned ddc0_nco_regmap_ch : 4;
    unsigned ddc0_nco_ch_sel_mode : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a04)
    unsigned ddco_profile_update_idx : 4;
    unsigned rsv0 : 2;
    unsigned ddc0_gpio_chip_trans_mode : 1;
    unsigned ddc0_profile_update_mode : 1;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a05)
    unsigned piw : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a06)
    unsigned piw : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a07)
    unsigned piw : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a08)
    unsigned piw : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a09)
    unsigned piw : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a0a)
    unsigned piw : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a0b)
    unsigned ddc0_phase_offset0 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a0c)
    unsigned ddc0_phase_offset1 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a0d)
    unsigned ddc0_phase_offset2 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a0e)
    unsigned ddc0_phase_offset3 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a0f)
    unsigned ddc0_phase_offset4 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a10)
    unsigned ddc0_phase_offset5 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a11)
    unsigned ddc0_phase_inc_frac_a0 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a12)
    unsigned ddc0_phase_inc_frac_a1 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a13)
    unsigned ddc0_phase_inc_frac_a2 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a14)
    unsigned ddc0_phase_inc_frac_a3 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a15)
    unsigned ddc0_phase_inc_frac_a4 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a16)
    unsigned ddc0_phase_inc_frac_a5 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a17)
    unsigned ddc0_phase_inc_frac_b0 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a18)
    unsigned ddc0_phase_inc_frac_b1 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a19)
    unsigned ddc0_phase_inc_frac_b2 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a1a)
    unsigned ddc0_phase_inc_frac_b3 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a1b)
    unsigned ddc0_phase_inc_frac_b4 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a1c)
    unsigned ddc0_phase_inc_frac_b5 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a1d)
    unsigned ddc0_chip_trans_status : 1;
    unsigned rsv0 : 7;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a1e)
    unsigned rsv0 : 1;
    unsigned en_ddc0_phase_dither : 1;
    unsigned rsv1 : 6;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a1f)
    unsigned ddc0_chip_trans : 1;
    unsigned rsv0 : 7;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a20)
    unsigned ddc0_psw0 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a21)
    unsigned ddc0_psw1 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a22)
    unsigned ddc0_psw2 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a23)
    unsigned ddc0_psw3 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a24)
    unsigned ddc0_psw4 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a25)
    unsigned ddc0_psw5 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a26)
    unsigned active_piw : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a27)
    unsigned active_piw : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a28)
    unsigned active_piw : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a29)
    unsigned active_piw : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a2a)
    unsigned active_piw : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a2b)
    unsigned active_piw : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a2c)
    unsigned ddc0_active_phase_offset0 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a2d)
    unsigned ddc0_active_phase_offset1 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a2e)
    unsigned ddc0_active_phase_offset2 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a2f)
    unsigned ddc0_active_phase_offset3 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a30)
    unsigned ddc0_active_phase_offset4 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a31)
    unsigned ddc0_active_phase_offset5 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a80)
    unsigned en_ddc_sync : 1;
    unsigned ddc_sync_next : 1;
    unsigned rsv0 : 2;
    unsigned ddc_soft_rst : 1;
    unsigned rsv1 : 2;
    unsigned en_ddc_trig_nco_rst : 1;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a81)
    unsigned ddc_sync_en_clr : 1;
    unsigned rsv0 : 7;
REG_DEF_CPT_SUFFIX_8

