Andydingbing/SPC5/rd/chip/reg_def_ad908x.h
REG_DEF_CPT_PREFIX_8(0x0a82)
    unsigned en_ddc_trig_hop : 1;
    unsigned rsv0 : 7;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a83)
    unsigned ddc0_nco_regmap_ch : 4;
    unsigned ddc0_nco_ch_sel_mode : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a84)
    unsigned ddc0_profile_update_idx : 4;
    unsigned rsv0 : 2;
    unsigned ddc0_gpio_chip_trans_mode : 1;
    unsigned ddc0_profile_update_mode : 1;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a85)
    unsigned ddc0_phase_inc0 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a86)
    unsigned ddc0_phase_inc1 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a87)
    unsigned ddc0_phase_inc2 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a88)
    unsigned ddc0_phase_inc3 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a89)
    unsigned ddc0_phase_inc4 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a8a)
    unsigned ddc0_phase_inc5 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a8b)
    unsigned ddc0_phase_offset0 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a8c)
    unsigned ddc0_phase_offset1 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a8d)
    unsigned ddc0_phase_offset2 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a8e)
    unsigned ddc0_phase_offset3 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a8f)
    unsigned ddc0_phase_offset4 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a90)
    unsigned ddc0_phase_offset5 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a91)
    unsigned ddc0_phase_inc_frac_a0 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a92)
    unsigned ddc0_phase_inc_frac_a1 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a93)
    unsigned ddc0_phase_inc_frac_a2 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a94)
    unsigned ddc0_phase_inc_frac_a3 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a95)
    unsigned ddc0_phase_inc_frac_a4 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a96)
    unsigned ddc0_phase_inc_frac_a5 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a97)
    unsigned ddc0_phase_inc_frac_b0 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a98)
    unsigned ddc0_phase_inc_frac_b1 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a99)
    unsigned ddc0_phase_inc_frac_b2 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a9a)
    unsigned ddc0_phase_inc_frac_b3 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a9b)
    unsigned ddc0_phase_inc_frac_b4 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a9c)
    unsigned ddc0_phase_inc_frac_b5 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a9d)
    unsigned ddc0_chip_trans_status : 1;
    unsigned rsv0 : 7;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a9e)
    unsigned rsv0 : 1;
    unsigned en_ddc0_phase_dither : 1;
    unsigned rsv1 : 6;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0a9f)
    unsigned ddc0_chip_trans : 1;
    unsigned rsv0 : 7;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0aa0)
    unsigned ddc0_psw0 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0aa1)
    unsigned ddc0_psw1 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0aa2)
    unsigned ddc0_psw2 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0aa3)
    unsigned ddc0_psw3 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0aa4)
    unsigned ddc0_psw4 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0aa5)
    unsigned ddc0_psw5 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0aa6)
    unsigned ddc0_active_phase_inc0 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0aa7)
    unsigned ddc0_active_phase_inc1 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0aa8)
    unsigned ddc0_active_phase_inc2 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0aa9)
    unsigned ddc0_active_phase_inc3 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0aaa)
    unsigned ddc0_active_phase_inc4 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0aab)
    unsigned ddc0_active_phase_inc5 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0aac)
    unsigned ddc0_active_phase_offset0 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0aad)
    unsigned ddc0_active_phase_offset1 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0aae)
    unsigned ddc0_active_phase_offset2 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0aaf)
    unsigned ddc0_active_phase_offset3 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0ab0)
    unsigned ddc0_active_phase_offset4 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0ab1)
    unsigned ddc0_active_phase_offset5 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0b00)
    unsigned rsv0 : 2;
    unsigned en_eq_gpio : 1;
    unsigned rsv1 : 5;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0b01)
    unsigned cshift0 : 4;
    unsigned rsv0 : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0b02)
    unsigned cshift1 : 4;
    unsigned rsv0 : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0b03)
    unsigned cshift2 : 4;
    unsigned rsv0 : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0b04)
    unsigned cshift3 : 4;
    unsigned rsv0 : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0b05)
    unsigned cdsel : 2;
    unsigned en_cd_gpio : 1;
    unsigned rsv0 : 5;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0b06)
    unsigned fdsel : 2;
    unsigned en_fd_gpio : 1;
    unsigned en_fd : 1;
    unsigned rsv0 : 1;
    unsigned eq_upsamp_clk_sel : 1;
    unsigned rsv1 : 2;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0b07)
    unsigned fshift0 : 4;
    unsigned rsv0 : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0b08)
    unsigned fshift1 : 4;
    unsigned rsv0 : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0b09)
    unsigned fshift2 : 4;
    unsigned rsv0 : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0b0a)
    unsigned fshift3 : 4;
    unsigned rsv0 : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0b12)
    unsigned pfilt_din_i_sel : 2;
    unsigned pfilt_din_q_sel : 2;
    unsigned rsv0 : 4;
REG_DEF_CPT_SUFFIX_8

