Andydingbing/SPC5/rd/chip/reg_def_ad908x.h
REG_DEF_CPT_PREFIX_8(0x0b13)
    unsigned pfilt_out_sel : 2;
    unsigned rsv0 : 6;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0b19)
    unsigned en_orx_gpio : 1;
    unsigned en_orx_reg : 1;
    unsigned orx_reg : 1;
    unsigned orx_fd_ctrl : 1;
    unsigned rsv0 : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0b1a)
    unsigned orx_cd_ctrl : 4;
    unsigned orx_pfir_ctrl : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0c0c)
    unsigned pfir_i_mode : 4;
    unsigned pfir_q_mode : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0c0d)
    unsigned pfir_ix_gain : 3;
    unsigned pfir_iy_gain : 3;
    unsigned rsv0 : 2;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0c0f)
    unsigned pfir_qx_gain : 3;
    unsigned pfir_qy_gain : 3;
    unsigned rsv0 : 2;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0c11)
    unsigned delay : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0c17)
    unsigned pfir_coef_trans : 1;
    unsigned rsv0 : 7;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0c1c)
    unsigned quad_mode : 1;
    unsigned rsv0 : 7;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0c1d)
    unsigned real_i_load : 1;
    unsigned real_q_load : 1;
    unsigned real_cross_i_load : 1;
    unsigned real_cross_q_load : 1;
    unsigned complex_load : 1;
    unsigned rsv0 : 2;
    unsigned gpio_config : 1;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0c1e)
    unsigned rd_coef_page : 2;
    unsigned rsv0 : 6;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0fb0)
    unsigned rsv0 : 3;
    unsigned en_spi_sysref : 1;
    unsigned rsv1 : 4;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x0fb8)
    unsigned sysref_setup : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x2008)
    unsigned pll_lock_slow : 1;
    unsigned pll_lock_fast : 1;
    unsigned rsv0 : 6;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x20d0)
    unsigned dsa_ctrl : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x20d1)
    unsigned dsa_cutover : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x20d2)
    unsigned dsa_boost : 5;
    unsigned rsv0 : 3;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x20d3)
    unsigned dp_gain : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x20d4)
    unsigned dp_gain : 4;
    unsigned rsv0 : 3;
    unsigned gain_load_strobe : 1;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x2c58)
    unsigned dsa0 : 2;
    unsigned dsa1 : 2;
    unsigned dsa2 : 2;
    unsigned dsa3 : 2;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x37cc)
    unsigned peri_i_12 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x37cd)
    unsigned peri_i_13 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x37ce)
    unsigned peri_i_14 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x37cf)
    unsigned peri_i_15 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x37d0)
    unsigned peri_i_16 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x37d1)
    unsigned peri_i_17 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x37d2)
    unsigned peri_i_18 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x37d3)
    unsigned peri_i_19 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x37d4)
    unsigned peri_i_20 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x37d5)
    unsigned peri_i_21 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x37d6)
    unsigned peri_i_22 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x37d7)
    unsigned peri_i_23 : 8;
REG_DEF_CPT_SUFFIX_8

REG_DEF_CPT_PREFIX_8(0x37d8)
    unsigned peri_i_24 : 8;
REG_DEF_CPT_SUFFIX_8

} // ns_reg_ad908x

#endif // INCLUDE_REG_DEF_AD908X_H
